app/controllers/v1/sessions_controller.rb

    def create
      user = User.find_by_email_and_password(session_params[:email], session_params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."password" = $2 LIMIT 1  [["email", "eric"], ["password", "helloz"]]