app/controllers/v1/users_controller.rb

    def create
      user = User.new(user_params)

      if user.has_capital_one_token? && user.save
---
INSERT INTO "users" ("email", "password", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "eric@eric.com"], ["password", "hello"], ["session_token", "M3d8K2G5rNoHw5cxM5M4Tw"], ["created_at", "2015-03-07 04:38:38.263184"], ["updated_at", "2015-03-07 04:38:38.263184"]]